[{"filename": "04af7b63-bbc1-4024-92ef-945b31865859.json", "plain_text": " JobTitle: User Experience Designer (UX) - Sr Description:\r\nUser Experience Research - Qualitative\r\n\r\n\r\nWe're looking for a User Experience Researcher - Qualitative Specialist to help us partner with our customers in developing desktop and mobile web sites for professionals in the legal, tax and corporate industries.\r\n\r\n\r\nUS:\r\n\r\nThis is a pivotal research role inside a technology company that is focused on customer experience and fluid interactions. We have best in class reputation for a large product mix and need our customer facing interactions to reflect this.\r\n\r\n\r\nYOU:\r\n\r\n• You have a passion for applying the Jobs to be Done framework to UX and understanding user outcomes.\r\n\r\n• You can keep pace with agile testing, but decouple from the churn to give design teams needed long term goals for hitting user objectives\r\n\r\n• You think beyond the click and ask: Why would anyone want to push this button in the first place?\r\n\r\n• You can write about this in a way that doesn't require voice over.\r\n\r\n• You can sketch in a collaborative way to make a point or illustrate a flow\r\n\r\n• Qualitative is your jam, Quantitative is an interesting puzzle, UX is a codeword for everything\r\n\r\n• The candidate should have demonstrated success in research facilitation as well as comfort in the role of research observer and note taker.\r\n\r\n\r\nThis is not a designer role; it is a role focusing on leading and executing design and usability research. However, experience with interaction design principles, tools, and techniques is important both for communication with the internal team and articulating issues to stakeholders. The successful candidate will be comfortable in a fast-paced environment where research studies will be executed on a weekly basis.\r\n\r\n\r\nCandidates should have a broad knowledge and experience with a wide variety of research methods, both qualitative and quantitative, including:\r\n\r\n• Qualitative analysis and reporting Interviewing and group facilitation techniques\r\n\r\n• Contextual Inquiries Remote Usability Testing Parallel Prototyping Persona Development\r\n\r\n• Un-moderated Feedback (example: UserZoom) Other User Centered Design (UCD) methods\r\n\r\n\r\nCandidates should be able to:\r\n\r\n• Quickly synthesize business objectives and customer needs\r\n\r\n• Develop a UX research approach, schedule, and detailed test plan\r\n\r\n• Plan, recruit, script, facilitate, collect, analyze, and document data\r\n\r\n• Identify and articulate user needs first and then potential usability issues both verbally and through documentation\r\n\r\n• Transform the data into prioritized, actionable recommendations (within a SHORT turn-around time)\r\n\r\n• Clearly communicate qualitative analysis, recommendations, and potential design solutions\r\n\r\n• Create persuasive presentations geared towards product owners, developers, visual designers, other UX team members, and c-level executives\r\n\r\n• Facilitate internal meetings to triage/manage research findings\r\n\r\n• Previous experience with design or research projects involving complex workflows, visualization of large datasets, operating system-level tools, and both web and software environments is a plus.\r\n\r\n\r\nQualifications:\r\n\r\n• Bachelor of Arts in a Social Science or Master of Science in a Social Sciences, Interaction Design, Human Factors, Cognitive Psychology, Cognitive Science, or related field is desired\r\n\r\n• 4+ years of experience applying research to high-volume, interactive B2B and B2C applications, rich web-based applications, or websites.\r\n\r\n• Strong, analytical problem solving, decision-making, and leadership\r\n\r\n• In-depth understanding of user-centered design principles and tools\r\n\r\n• Familiarity with SharePoint, project management tool like Jira\r\n\r\n• Familiarity performing studies in a fixed and virtual lab environment\r\n\r\n• Familiarity with data-logging tools and systems such as Tableau, Qualtrics, Morae or would be helpful.\r\n Skills: User Experience, Quantitative Research", "job_title": {"MainJobTitle": "User Experience Designer (UX)", "JobTitle": ["User Experience Designer", "Qualitative Specialist"]}}, {"filename": "0dbe68dc-1e0c-4d20-b493-549626c3ad86.json", "plain_text": "    JobTitle: User Experience Researcher\r\n    Description: <p>test..</p>\r\n    Skills: UX Design, UI Design, User Research", "job_title": {"MainJobTitle": "User Experience Researcher", "JobTitle": []}}, {"filename": "1eef1e2e-2257-4ae1-bb4e-b9b1305c7a21.json", "plain_text": " JobTitle: Graphic Design Specialist Description:\r\nBrand Marketing, Agency Management\r\n\r\n\r\nOVERVIEW\r\n\r\n\r\nAs a Graphic Design Specialist, you will be leading the charge to produce and oversee digital and print creative design to address the marketing needs within Thomson Reuters. With an in-depth knowledge of graphic design, styles and layout techniques you will use your craft to create visual assets that bring the Thomson Reuters brand to life. Your experience in executing creative marketing projects from conception to production including deliverables such as digital graphics and animations, marketing collateral, and virtual event support will be core to your success. Ultimately, you will ensure the design team promotes our brand by delivering high-quality designed pieces on tight deadlines.\r\n\r\n\r\nRESPONSIBILITIES\r\n\r\n\r\nThe Graphic Designer is responsible for delivering the best-in-class design for our marketing teams while demonstrating strong problem-solving skills and a deep understanding of Thomson Reuters and its customers.\r\n\r\n\r\n• Act as the primary conceptors for Thomson Reuters Studio teams\r\n\r\n• Provide design and production for large, multi-faceted events to smaller, single tactic projects\r\n\r\n• Deliver work that is technically accurate in its use of the Thomson Reuters brand guidelines\r\n\r\n• Deliver consistent client satisfaction.\r\n\r\n• Simultaneously manage multiple projects with short deadlines\r\n\r\n• Consistent demonstration of the ability to accomplish tasks for numerous projects\r\n\r\n• Demonstrate a relentless pursuit of knowledge as it relates to industry best practices\r\n\r\n\r\nEDUCATION\r\n\r\n\r\nB.A. Degree in Graphic Design (or related degree).\r\n\r\n\r\nEXPERIENCE\r\n\r\n\r\n• Three years+ of experience as a graphic designer (or equivalent), preferably in an industry or industries identical to those at Thomson Reuters\r\n\r\n• Strong graphic design skills with emphasis on standard industry tools including Mac skills and expertise in Adobe Creative Suite including Indesign, Illustration, Photoshop\r\n\r\n• Experience in After Effects is a plus\r\n\r\n• Superior knowledge of design techniques, typography, photography, and digital file preparation\r\n\r\n• Ability to create original, conceptual designs for a wide variety of tactics and deliverables\r\n\r\n• Project management skills and the ability to work within project management and DAM tools\r\n\r\n\r\nAt Thomson Reuters, we believe what we do matters. We are passionate about our work, inspired by the impact it has on our business and our customers. As a marketing team, we believe in winning as one - collaborating to reach shared goals, and developing through challenging and meaningful experiences to produce cutting-edge marketing campaigns that promote Thomson Reuters.\r\n\r\n\r\nWith over 50,000 employees in more than 100 countries, we work flexibly across boundaries and realize innovations that help shape industries around the world. Bring your ambition to make a difference. We'll bring a world of opportunities.\r\n Skills: Graphic Design, Adobe after effects, Adobe Photoshop, Adobe Creative Cloud", "job_title": {"MainJobTitle": "Graphic Design Specialist", "JobTitle": ["Graphic Designer"]}}, {"filename": "2160ebcd-3f08-48a8-8db3-62209905c61e.json", "plain_text": "    JobTitle: User Experience Designer (UX)\r\n    Description: <p>test</p>\r\n    Skills: visual design, UX Design, UI Design", "job_title": {"MainJobTitle": "User Experience Designer (UX)", "JobTitle": ["User Experience Designer"]}}, {"filename": "22c1238a-7525-4f19-8fe6-a716190dd208.json", "plain_text": "    JobTitle: User Interface Designer\r\n    Description: <p>test</p>\r\n    Skills: UX Design, UI Design", "job_title": {"MainJobTitle": "User Interface Designer", "JobTitle": []}}, {"filename": "30ce9ee5-4910-427e-ae36-7f3f68bd3406.json", "plain_text": " JobTitle: Audience Specialist Description:\r\nAudience Specialist (Remote)\r\n\r\n\r\nDescription\r\n\r\nThe Audience Specialist will be a key member of the Data and Analytics teams and reports to the Head of Data Operations for Reuters. This candidate will manage all aspects of Reuters audience insight and audience growth initiatives across platforms, globally.\r\n\r\n\r\nResponsibilities include understanding and analyzing user behavior/trends, audience composition and engagement to gain a 360-degree understanding of the Reuters customer, across all touchpoints. This role will leverage available datasets, technology and partnerships to support business KPIs. The candidate will work across product, editorial, and sales teams to distribute deterministic audience insights & recommendations all interested parties.\r\n\r\n\r\nOur ideal candidate is someone with an intense curiosity and passion for problem solving, the ability to envision solutions, a positive can-do-attitude, along with strong communications and interpersonal skills.\r\n\r\n\r\nResponsibilities:\r\n\r\n• Ownership and responsibility for managing one or more work streams across multiple business units\r\n\r\n• Hands-on-keys DMP operational administration\r\n\r\n• Lead DMP taxonomy initiatives building and maintenance to ensure maximum data collection\r\n\r\n• Develop and maintain project plans\r\n\r\n• Oversee and maintain audience platforms and manage relationships with vendor counterparts\r\n\r\n• Facilitate onboarding of online and offline client data into DMP\r\n\r\n• Serve as digital audience eco-system technical integration subject matter expert\r\n\r\n• Manage relationships & contracts with third party data vendors\r\n\r\n• Proactively research and troubleshoot with internal and external partners/vendors\r\n\r\n• Work with extended team to solve for gaps in technology stack, and proactively propose solutions and workarounds\r\n\r\n• Maintain detailed and up to date status of work streams for team lead and other stakeholders\r\n\r\n• Analyze and identify insights, summarizing and preparing for internal and external presentations\r\n\r\n• Implement and maintain quality control measures both internally and with vendor partners\r\n\r\n• Question the status quo ? ensure audience operations grow with the expanding larger business\r\n\r\n\r\nRequired Skills:\r\n\r\n• Bachelor's degree required\r\n\r\n• Minimum 2 years? experience working with audience analytics or data management platform(s) for a major web publisher or agency\r\n\r\n• Excellent understanding of media fundamentals and industry knowledge, including media metrics, GDPR compliance and quantitative business measures\r\n\r\n• Strong analytical skills with the ability to apply audience insights and data analysis into actionable business strategy recommendations\r\n\r\n• Hands on experience with DMPs such as BlueKai, Salesforce DMP, Lotame. Experience with Adobe Audience Manager a plus\r\n\r\n• Experience with data onboarding of offline and online data\r\n\r\n• Strong understanding of traditional data providers, types of audience data and collection methodologies\r\n\r\n• Ability to properly interpret audience insights and trends to translate into report iterations & trend graphs\r\n\r\n• Capable of managing multiple projects within a deadline-driven environment\r\n\r\n• Knack to for building relationships with cross-functional teams by influencing with sound logic\r\n\r\n• Excellent communication and collaboration skills\r\n\r\n• Proactive and highly organized\r\n\r\n• Excellent PowerPoint & Excel skills\r\n\r\n\r\nDesired Skills:\r\n\r\n• Experience in the streaming media industry or other subscription-based service.\r\n\r\n• Proficient in Site Analytics Platforms such as Google Analytics, Amplitude or Adobe Analytics\r\n\r\n• Understanding of Data Governance policies globally\r\n\r\n• Experience working for a media publisher or agency a plus\r\n\r\n• Basic knowledge of AWS or Google Big Query\r\n\r\n• Experience with data integration and data transfer processes\r\n\r\n• Some familiarity with business intelligence platforms/ visualization tools (e.g., Tableau, Chartio, etc.)\r\n\r\n• Basic understanding of ad serving, tracking and reporting tools including DoubleClick, DART, Google Ad Manager (GAM)\r\n\r\n• Thought leadership and creativity in solving challenging, and potentially ambiguous, business problems...\r\n Skills: Taxonomy, Data Management, Audience Analytics", "job_title": {"MainJobTitle": "Audience Specialist", "JobTitle": ["Audience Specialist (Remote)"]}}, {"filename": "354313f4-14f6-4d7e-83ea-da7addda0c39.json", "plain_text": " JobTitle: (Canada) Technical Analyst - Sr Description:\r\nTechnical Analyst - Middleware\r\n\r\n\r\nThomson Reuters is the Answer Company. We provide authoritative content, advanced technologies and human expertise to help our customers find trusted answers. We enable professionals in the legal, tax and accounting, and media markets to make the decisions that matter most, all powered by the world's most trusted news organization.\r\n\r\n\r\nThe Corporate Legal group is looking to add a Technical Analyst to the Operations team at our new Technology Center in Toronto, Ontario, conveniently located within walking distance of Union Station. Our plan is to create around 1,500 technology and operations jobs in the coming years.\r\n\r\n\r\nThe purpose of this role is to build and maintain Microsoft computing platform of systems/services to sustain a high level of up-time and quality for our customers.\r\n\r\n\r\nLegal Tracker is an industry leading corporate legal solution with focus in matter management, e-billing and analytics. As a SaaS offering, this product caters to over 1300 corporate legal departments in North America to streamline operations, control spend and get complete visibility into the legal landscape.\r\n\r\n\r\nResponsibilities include but aren't limited to:\r\n\r\n•    Analyze and develop technology solutions based on customer requirements.\r\n\r\n•    Build and implement middleware products to meet business demands using Infrastructure as Code\r\n\r\n•    Work with Developers, Architects and Analyst in developing middleware configurations based on requirements.\r\n\r\n•    Identify and apply innovative technologies to update existing middleware.\r\n\r\n•    Create and maintain documentation for middleware installations, changes and upgrades.\r\n\r\n•  Troubleshoot, resolve and document technical problems in timely and accurate manner to improve application performance and functionality.\r\n\r\n•    Train Operations associates on middleware updates and new installations.\r\n\r\n•    Coordinate with vendors and support team on problem resolution, design issues and upgrades.\r\n\r\n•    Perform troubleshooting, incident response, and patching in a timely manner.\r\n\r\n•    Develop and implement strategies for migration, consolidation and upgrade of middleware components.\r\n\r\n•    Evaluate system architecture and make recommendations as required.\r\n\r\n•    Develop and implement standard processes for installation, maintenance and enhancement of middleware applications.\r\n\r\n\r\nExperience:\r\n\r\n•    3+ years in Azure Infrastructure roles.\r\n\r\n•    3+ years in implementing and administrating Azure Service Bus\r\n\r\n•    3+ years in deploying Infrastructure As Code\r\n\r\n•    3+ years of experience in supporting Production Environments\r\n\r\n•    3 + years of scripting in one language ( Powershell, Python, etc)\r\n\r\n•    Supported multi-tenant systems, preferably for a SaaS application\r\n\r\n•    Involved with support of a complex architecture\r\n\r\n\r\nQualifications:\r\n\r\n•    Experience working knowledge of Azure Cloud\r\n\r\n•    Experience in Middleware (preferably Azure Service Bus) Implementation and Administration\r\n\r\n•    Experience in at least one scripting language (PowerShell, VBScript, Python etc.)\r\n\r\n•    Motivated self-starter, reliable, dedicated, with scheduling flexibility\r\n\r\n•    Experience in Infrastructure as Code Development and Deployment\r\n\r\n•    Good analytical and problem-solving skills\r\n\r\n•    Security-minded and Strong customer service orientation\r\n\r\n•    Ability to prioritize and organize time to follow through with assigned functions.\r\n\r\n•    Must have excellent verbal and written communication skills, including ability to compile, interpret, and utilize information; and to communicate effectively with people of all backgrounds and educational levels.\r\n\r\n•    Ability to present ideas and solutions in user-friendly language\r\n\r\n•    Must be well organized and have good attention to detail\r\n\r\n•    Skilled at working within a team-oriented, collaborative environment\r\n\r\n\r\nEducation:\r\n\r\nMinimum working towards a Degree in Computer Science or related field\r\n Skills: Azure, middleware", "job_title": {"MainJobTitle": "Technical Analyst", "JobTitle": ["(Canada) Technical Analyst - Sr Description"]}}, {"filename": "386c765b-b02c-4f27-8752-7c4df91c295a.json", "plain_text": "    JobTitle: User Experience Designer (UX)\r\n    Description: <p>Test</p>\r\n    Skills: UX Design, UI Design", "job_title": {"MainJobTitle": "User Experience Designer (UX)", "JobTitle": ["User Experience Designer"]}}, {"filename": "4cbdc3e4-058c-4853-b3ea-0ac0b5b81ef5.json", "plain_text": " JobTitle: (Canada) Audience Specialist Description:\r\nAudience Specialist (Remote)\r\n\r\n\r\nDescription\r\n\r\nThe Audience Specialist will be a key member of the Data and Analytics teams and reports to the Head of Data Operations for Reuters. This candidate will manage all aspects of Reuters audience insight and audience growth initiatives across platforms, globally.\r\n\r\n\r\nResponsibilities include understanding and analyzing user behavior/trends, audience composition and engagement to gain a 360-degree understanding of the Reuters customer, across all touchpoints. This role will leverage available datasets, technology and partnerships to support business KPIs. The candidate will work across product, editorial, and sales teams to distribute deterministic audience insights & recommendations all interested parties.\r\n\r\n\r\nOur ideal candidate is someone with an intense curiosity and passion for problem solving, the ability to envision solutions, a positive can-do-attitude, along with strong communications and interpersonal skills.\r\n\r\n\r\nResponsibilities:\r\n\r\n• Ownership and responsibility for managing one or more work streams across multiple business units\r\n\r\n• Hands-on-keys DMP operational administration\r\n\r\n• Lead DMP taxonomy initiatives building and maintenance to ensure maximum data collection\r\n\r\n• Develop and maintain project plans\r\n\r\n• Oversee and maintain audience platforms and manage relationships with vendor counterparts\r\n\r\n• Facilitate onboarding of online and offline client data into DMP\r\n\r\n• Serve as digital audience eco-system technical integration subject matter expert\r\n\r\n• Manage relationships & contracts with third party data vendors\r\n\r\n• Proactively research and troubleshoot with internal and external partners/vendors\r\n\r\n• Work with extended team to solve for gaps in technology stack, and proactively propose solutions and workarounds\r\n\r\n• Maintain detailed and up to date status of work streams for team lead and other stakeholders\r\n\r\n• Analyze and identify insights, summarizing and preparing for internal and external presentations\r\n\r\n• Implement and maintain quality control measures both internally and with vendor partners\r\n\r\n• Question the status quo ? ensure audience operations grow with the expanding larger business\r\n\r\n\r\nRequired Skills:\r\n\r\n• Bachelor's degree required\r\n\r\n• Minimum 2 years? experience working with audience analytics or data management platform(s) for a major web publisher or agency\r\n\r\n• Excellent understanding of media fundamentals and industry knowledge, including media metrics, GDPR compliance and quantitative business measures\r\n\r\n• Strong analytical skills with the ability to apply audience insights and data analysis into actionable business strategy recommendations\r\n\r\n• Hands on experience with DMPs such as BlueKai, Salesforce DMP, Lotame. Experience with Adobe Audience Manager a plus\r\n\r\n• Experience with data onboarding of offline and online data\r\n\r\n• Strong understanding of traditional data providers, types of audience data and collection methodologies\r\n\r\n• Ability to properly interpret audience insights and trends to translate into report iterations & trend graphs\r\n\r\n• Capable of managing multiple projects within a deadline-driven environment\r\n\r\n• Knack to for building relationships with cross-functional teams by influencing with sound logic\r\n\r\n• Excellent communication and collaboration skills\r\n\r\n• Proactive and highly organized\r\n\r\n• Excellent PowerPoint & Excel skills\r\n\r\n\r\nDesired Skills:\r\n\r\n• Experience in the streaming media industry or other subscription-based service\r\n\r\n• Proficient in Site Analytics Platforms such as Google Analytics, Amplitude or Adobe Analytics\r\n\r\n• Understanding of Data Governance policies globally\r\n\r\n• Experience working for a media publisher or agency a plus\r\n\r\n• Basic knowledge of AWS or Google Big Query\r\n\r\n• Experience with data integration and data transfer processes\r\n\r\n• Some familiarity with business intelligence platforms/ visualization tools (e.g., Tableau, Chartio, etc.)\r\n\r\n• Basic understanding of ad serving, tracking and reporting tools including DoubleClick, DART, Google Ad Manager (GAM)\r\n\r\n• Thought leadership and creativity in solving challenging, and potentially ambiguous, business problems...\r\n Skills: Taxonomy, Data Management", "job_title": {"MainJobTitle": "Audience Specialist", "JobTitle": ["Audience Specialist (Remote)"]}}, {"filename": "5fa4b18b-cae2-4b3b-a0fd-dcb7dad5595f.json", "plain_text": " JobTitle: Audience Specialist Description:\r\nAudience Specialist (Remote)\r\n\r\n\r\nDescription\r\n\r\nThe Audience Specialist will be a key member of the Data and Analytics teams and reports to the Head of Data Operations for Reuters. This candidate will manage all aspects of Reuters audience insight and audience growth initiatives across platforms, globally.\r\n\r\n\r\nResponsibilities include understanding and analyzing user behavior/trends, audience composition and engagement to gain a 360-degree understanding of the Reuters customer, across all touchpoints. This role will leverage available datasets, technology and partnerships to support business KPIs. The candidate will work across product, editorial, and sales teams to distribute deterministic audience insights & recommendations all interested parties.\r\n\r\n\r\nOur ideal candidate is someone with an intense curiosity and passion for problem solving, the ability to envision solutions, a positive can-do-attitude, along with strong communications and interpersonal skills.\r\n\r\n\r\nResponsibilities:\r\n\r\n• Ownership and responsibility for managing one or more work streams across multiple business units\r\n\r\n• Hands-on-keys DMP operational administration\r\n\r\n• Lead DMP taxonomy initiatives building and maintenance to ensure maximum data collection\r\n\r\n• Develop and maintain project plans\r\n\r\n• Oversee and maintain audience platforms and manage relationships with vendor counterparts\r\n\r\n• Facilitate onboarding of online and offline client data into DMP\r\n\r\n• Serve as digital audience eco-system technical integration subject matter expert\r\n\r\n• Manage relationships & contracts with third party data vendors\r\n\r\n• Proactively research and troubleshoot with internal and external partners/vendors\r\n\r\n• Work with extended team to solve for gaps in technology stack, and proactively propose solutions and workarounds\r\n\r\n• Maintain detailed and up to date status of work streams for team lead and other stakeholders\r\n\r\n• Analyze and identify insights, summarizing and preparing for internal and external presentations\r\n\r\n• Implement and maintain quality control measures both internally and with vendor partners\r\n\r\n• Question the status quo ? ensure audience operations grow with the expanding larger business\r\n\r\n\r\nRequired Skills:\r\n\r\n• Bachelor's degree required\r\n\r\n• Minimum 2 years? experience working with audience analytics or data management platform(s) for a major web publisher or agency\r\n\r\n• Excellent understanding of media fundamentals and industry knowledge, including media metrics, GDPR compliance and quantitative business measures\r\n\r\n• Strong analytical skills with the ability to apply audience insights and data analysis into actionable business strategy recommendations\r\n\r\n• Hands on experience with DMPs such as BlueKai, Salesforce DMP, Lotame. Experience with Adobe Audience Manager a plus\r\n\r\n• Experience with data onboarding of offline and online data\r\n\r\n• Strong understanding of traditional data providers, types of audience data and collection methodologies\r\n\r\n• Ability to properly interpret audience insights and trends to translate into report iterations & trend graphs\r\n\r\n• Capable of managing multiple projects within a deadline-driven environment\r\n\r\n• Knack to for building relationships with cross-functional teams by influencing with sound logic\r\n\r\n• Excellent communication and collaboration skills\r\n\r\n• Proactive and highly organized\r\n\r\n• Excellent PowerPoint & Excel skills\r\n\r\n\r\nDesired Skills:\r\n\r\n• Experience in the streaming media industry or other subscription-based service\r\n\r\n• Proficient in Site Analytics Platforms such as Google Analytics, Amplitude or Adobe Analytics\r\n\r\n• Understanding of Data Governance policies globally\r\n\r\n• Experience working for a media publisher or agency a plus\r\n\r\n• Basic knowledge of AWS or Google Big Query\r\n\r\n• Experience with data integration and data transfer processes\r\n\r\n• Some familiarity with business intelligence platforms/ visualization tools (e.g., Tableau, Chartio, etc.)\r\n\r\n• Basic understanding of ad serving, tracking and reporting tools including DoubleClick, DART, Google Ad Manager (GAM)\r\n\r\n• Thought leadership and creativity in solving challenging, and potentially ambiguous, business problems...\r\n Skills: Taxonomy, Data Management Platform", "job_title": {"MainJobTitle": "Audience Specialist", "JobTitle": ["Audience Specialist (Remote)"]}}, {"filename": "9135320a-1d7d-4edd-8e18-035a165fd083.json", "plain_text": " JobTitle: (Canada) Audience Specialist Description:\r\nAudience Specialist (Remote)\r\n\r\n\r\nDescription\r\n\r\nThe Audience Specialist will be a key member of the Data and Analytics teams and reports to the Head of Data Operations for Reuters. This candidate will manage all aspects of Reuters audience insight and audience growth initiatives across platforms, globally.\r\n\r\n\r\nResponsibilities include understanding and analyzing user behavior/trends, audience composition and engagement to gain a 360-degree understanding of the Reuters customer, across all touchpoints. This role will leverage available datasets, technology and partnerships to support business KPIs. The candidate will work across product, editorial, and sales teams to distribute deterministic audience insights & recommendations all interested parties.\r\n\r\n\r\nOur ideal candidate is someone with an intense curiosity and passion for problem solving, the ability to envision solutions, a positive can-do-attitude, along with strong communications and interpersonal skills.\r\n\r\n\r\nResponsibilities:\r\n\r\n• Ownership and responsibility for managing one or more work streams across multiple business units\r\n\r\n• Hands-on-keys DMP operational administration\r\n\r\n• Lead DMP taxonomy initiatives building and maintenance to ensure maximum data collection\r\n\r\n• Develop and maintain project plans\r\n\r\n• Oversee and maintain audience platforms and manage relationships with vendor counterparts\r\n\r\n• Facilitate onboarding of online and offline client data into DMP\r\n\r\n• Serve as digital audience eco-system technical integration subject matter expert\r\n\r\n• Manage relationships & contracts with third party data vendors\r\n\r\n• Proactively research and troubleshoot with internal and external partners/vendors\r\n\r\n• Work with extended team to solve for gaps in technology stack, and proactively propose solutions and workarounds\r\n\r\n• Maintain detailed and up to date status of work streams for team lead and other stakeholders\r\n\r\n• Analyze and identify insights, summarizing and preparing for internal and external presentations\r\n\r\n• Implement and maintain quality control measures both internally and with vendor partners\r\n\r\n• Question the status quo ? ensure audience operations grow with the expanding larger business\r\n\r\n\r\nRequired Skills:\r\n\r\n• Bachelor's degree required\r\n\r\n• Minimum 2 years? experience working with audience analytics or data management platform(s) for a major web publisher or agency\r\n\r\n• Excellent understanding of media fundamentals and industry knowledge, including media metrics, GDPR compliance and quantitative business measures\r\n\r\n• Strong analytical skills with the ability to apply audience insights and data analysis into actionable business strategy recommendations\r\n\r\n• Hands on experience with DMPs such as BlueKai, Salesforce DMP, Lotame. Experience with Adobe Audience Manager a plus\r\n\r\n• Experience with data onboarding of offline and online data\r\n\r\n• Strong understanding of traditional data providers, types of audience data and collection methodologies\r\n\r\n• Ability to properly interpret audience insights and trends to translate into report iterations & trend graphs\r\n\r\n• Capable of managing multiple projects within a deadline-driven environment\r\n\r\n• Knack to for building relationships with cross-functional teams by influencing with sound logic\r\n\r\n• Excellent communication and collaboration skills\r\n\r\n• Proactive and highly organized\r\n\r\n• Excellent PowerPoint & Excel skills\r\n\r\n\r\nDesired Skills:\r\n\r\n• Experience in the streaming media industry or other subscription-based service\r\n\r\n• Proficient in Site Analytics Platforms such as Google Analytics, Amplitude or Adobe Analytics\r\n\r\n• Understanding of Data Governance policies globally\r\n\r\n• Experience working for a media publisher or agency a plus\r\n\r\n• Basic knowledge of AWS or Google Big Query\r\n\r\n• Experience with data integration and data transfer processes\r\n\r\n• Some familiarity with business intelligence platforms/ visualization tools (e.g., Tableau, Chartio, etc.)\r\n\r\n• Basic understanding of ad serving, tracking and reporting tools including DoubleClick, DART, Google Ad Manager (GAM)\r\n\r\n• Thought leadership and creativity in solving challenging, and potentially ambiguous, business problems....\r\n Skills: Taxonomy, Data Management", "job_title": {"MainJobTitle": "Audience Specialist", "JobTitle": ["Audience Specialist (Remote)"]}}, {"filename": "91dd2458-09b7-4907-bf49-3c663c7d77f0.json", "plain_text": "    JobTitle: User Experience Designer (UX) - Sr\r\n    Description: <p>Test..</p>\r\n    Skills: UX Design, UI Design", "job_title": {"MainJobTitle": "User Experience Designer (UX) - Sr", "JobTitle": ["User Experience Designer", "User Experience Designer (UX)"]}}, {"filename": "951b1c5d-3763-4e03-bd77-1cc4283c52b2.json", "plain_text": "    JobTitle: User Experience Designer (UX) - Sr\r\n    Description: <p>test.....</p>\r\n    Skills: UX Design, User Centric Design, User experience design, UI Design", "job_title": {"MainJobTitle": "User Experience Designer (UX) - Sr", "JobTitle": ["User Experience Designer", "User Experience Designer (UX)"]}}, {"filename": "9734bd8e-ca63-45f5-813e-05b3d00bdbba.json", "plain_text": "    JobTitle: Software Developer - Sr\r\n    Description: <p><strong>Job Title & Location:</strong></p><p>Senior Software Engineer</p><p><strong>Description:</strong></p><p>The Thomson Reuters Platform API team is looking for a talented, experienced and motivated software engineer to join our group. Do you want to help lead a transformation at TR to an API-First architecture and build the microservices-based platform that supports it? In this role, you will collaborate with technology peers to design, build and deploy the foundation for the next generation of modern cloud native software applications and services for Thomson Reuters.</p><p>You will be part of the cross-functional team that builds tools to allow multiple language integrations to TR APIs, develops automated systems to ensure API quality, integrity and performance, and helps global teams at TR follow the common best practices and standards for API development.</p><p><strong>Job Responsibilities:</strong></p><ul><li>Write new software, make modifications to existing software, and integrate software applications and modules as part of an agile software development process</li><li>Write well-designed, well-constructed, and well-tested code</li><li>Participate in project planning sessions with team members to analyze development requirements, provide design options, and provide work breakdown and estimates of work</li><li>Provide status updates for own scope of work within projects</li><li>Participate in internal team and status meetings</li><li>Research and recommend enhancements and new features, working closely with development leads</li><li>Provide technical support and resolution for customer-related issues</li><li>Provide creative and elegant solutions to complex problems</li><li>Prepare technical specifications and documentation</li><li>Participate in software releases</li></ul><p><strong>Basic Qualifications:</strong></p><ul><li>Bachelor's degree in Computer Science, Software Engineering, or related field</li><li>5+ years of experience in a software engineering role, with most or all of the following technical skills:</li><li class=\"ql-indent-1\">Coding in Java, NodeJS and/or .NET</li><li class=\"ql-indent-1\">Cloud development on AWS, Azure or GCP required</li><li class=\"ql-indent-1\">Developing REST APIs with a good understand of security principles and JWT related standards</li><li class=\"ql-indent-1\">CI/CD automation</li><li class=\"ql-indent-1\">API Management systems</li><li class=\"ql-indent-1\">Identity and Access Management – user authentication and authorization, SSO and federation</li><li class=\"ql-indent-1\">Configuration management tools</li><li class=\"ql-indent-1\">Computer science principles and algorithms</li><li>Able to demonstrate experience and skills in software development best practices, such as:</li><li class=\"ql-indent-1\">Understanding agile/scrum development methodologies</li><li class=\"ql-indent-1\">Working in a team environment to solve problems, identify solutions and improve continuously</li><li class=\"ql-indent-1\">Communicate effectively verbally and in writing to different audiences</li><li class=\"ql-indent-1\">Writing technical documentation for developers</li><li class=\"ql-indent-1\">Problem-solving and critical thinking</li><li class=\"ql-indent-1\">Continuously learning new skills and technologies .</li></ul>\r\n    Skills: Azure, node.js, AWS, API, REST, nodejs, Application Development", "job_title": {"MainJobTitle": "Software Developer - Sr", "JobTitle": []}}, {"filename": "98773ee1-568a-420c-bd84-d600d6501b55.json", "plain_text": "    JobTitle: User Experience Designer\r\n    Description: <p>test</p>\r\n    Skills: visual design, UX Design, UI Design", "job_title": {"MainJobTitle": "User Experience Designer", "JobTitle": []}}, {"filename": "9ccd0d01-3fa4-4705-87e7-bcfc99ffd707.json", "plain_text": " JobTitle: Audience Specialist Description:\r\nAudience Specialist (Remote)\r\n\r\n\r\nDescription\r\n\r\nThe Audience Specialist will be a key member of the Data and Analytics teams and reports to the Head of Data Operations for Reuters. This candidate will manage all aspects of Reuters audience insight and audience growth initiatives across platforms, globally.\r\n\r\n\r\nResponsibilities include understanding and analyzing user behavior/trends, audience composition and engagement to gain a 360-degree understanding of the Reuters customer, across all touchpoints. This role will leverage available datasets, technology and partnerships to support business KPIs. The candidate will work across product, editorial, and sales teams to distribute deterministic audience insights & recommendations all interested parties.\r\n\r\n\r\nOur ideal candidate is someone with an intense curiosity and passion for problem solving, the ability to envision solutions, a positive can-do-attitude, along with strong communications and interpersonal skills.\r\n\r\n\r\nResponsibilities:\r\n\r\n• Ownership and responsibility for managing one or more work streams across multiple business units\r\n\r\n• Hands-on-keys DMP operational administration\r\n\r\n• Lead DMP taxonomy initiatives building and maintenance to ensure maximum data collection\r\n\r\n• Develop and maintain project plans\r\n\r\n• Oversee and maintain audience platforms and manage relationships with vendor counterparts\r\n\r\n• Facilitate onboarding of online and offline client data into DMP\r\n\r\n• Serve as digital audience eco-system technical integration subject matter expert\r\n\r\n• Manage relationships & contracts with third party data vendors\r\n\r\n• Proactively research and troubleshoot with internal and external partners/vendors\r\n\r\n• Work with extended team to solve for gaps in technology stack, and proactively propose solutions and workarounds\r\n\r\n• Maintain detailed and up to date status of work streams for team lead and other stakeholders\r\n\r\n• Analyze and identify insights, summarizing and preparing for internal and external presentations\r\n\r\n• Implement and maintain quality control measures both internally and with vendor partners\r\n\r\n• Question the status quo ? ensure audience operations grow with the expanding larger business\r\n\r\n\r\nRequired Skills:\r\n\r\n• Bachelor's degree required\r\n\r\n• Minimum 2 years? experience working with audience analytics or data management platform(s) for a major web publisher or agency\r\n\r\n• Excellent understanding of media fundamentals and industry knowledge, including media metrics, GDPR compliance and quantitative business measures\r\n\r\n• Strong analytical skills with the ability to apply audience insights and data analysis into actionable business strategy recommendations\r\n\r\n• Hands on experience with DMPs such as BlueKai, Salesforce DMP, Lotame. Experience with Adobe Audience Manager a plus\r\n\r\n• Experience with data onboarding of offline and online data\r\n\r\n• Strong understanding of traditional data providers, types of audience data and collection methodologies\r\n\r\n• Ability to properly interpret audience insights and trends to translate into report iterations & trend graphs\r\n\r\n• Capable of managing multiple projects within a deadline-driven environment\r\n\r\n• Knack to for building relationships with cross-functional teams by influencing with sound logic\r\n\r\n• Excellent communication and collaboration skills\r\n\r\n• Proactive and highly organized\r\n\r\n• Excellent PowerPoint & Excel skills\r\n\r\n\r\nDesired Skills:\r\n\r\n• Experience in the streaming media industry or other subscription-based service\r\n\r\n• Proficient in Site Analytics Platforms such as Google Analytics, Amplitude or Adobe Analytics\r\n\r\n• Understanding of Data Governance policies globally\r\n\r\n• Experience working for a media publisher or agency a plus\r\n\r\n• Basic knowledge of AWS or Google Big Query\r\n\r\n• Experience with data integration and data transfer processes\r\n\r\n• Some familiarity with business intelligence platforms/ visualization tools (e.g., Tableau, Chartio, etc.)\r\n\r\n• Basic understanding of ad serving, tracking and reporting tools including DoubleClick, DART, Google Ad Manager (GAM)\r\n\r\n• Thought leadership and creativity in solving challenging, and potentially ambiguous, business problems.....\r\n Skills: Taxonomy, Audience Analytics, Data Management Platform", "job_title": {"MainJobTitle": "Audience Specialist", "JobTitle": ["Audience Specialist (Remote)"]}}, {"filename": "aed3d663-1955-413d-b812-8ef8bc4beca5.json", "plain_text": " JobTitle: UX Researcher - Sr Description:\r\nUser Experience Research - Qualitative\r\n\r\n\r\nWe're looking for a User Experience Researcher - Qualitative Specialist to help us partner with our customers in developing desktop and mobile web sites for professionals in the legal, tax and corporate industries.\r\n\r\n\r\nUS:\r\n\r\nThis is a pivotal research role inside a technology company that is focused on customer experience and fluid interactions. We have best in class reputation for a large product mix and need our customer facing interactions to reflect this.\r\n\r\n\r\nYOU:\r\n\r\n• You have a passion for applying the Jobs to be Done framework to UX and understanding user outcomes.\r\n\r\n• You can keep pace with agile testing, but decouple from the churn to give design teams needed long term goals for hitting user objectives\r\n\r\n• You think beyond the click and ask: Why would anyone want to push this button in the first place?\r\n\r\n• You can write about this in a way that doesn't require voice over.\r\n\r\n• You can sketch in a collaborative way to make a point or illustrate a flow\r\n\r\n• Qualitative is your jam, Quantitative is an interesting puzzle, UX is a codeword for everything\r\n\r\n• The candidate should have demonstrated success in research facilitation as well as comfort in the role of research observer and note taker.\r\n\r\n\r\nThis is not a designer role; it is a role focusing on leading and executing design and usability research. However, experience with interaction design principles, tools, and techniques is important both for communication with the internal team and articulating issues to stakeholders. The successful candidate will be comfortable in a fast-paced environment where research studies will be executed on a weekly basis.\r\n\r\n\r\nCandidates should have a broad knowledge and experience with a wide variety of research methods, both qualitative and quantitative, including:\r\n\r\n• Qualitative analysis and reporting Interviewing and group facilitation techniques\r\n\r\n• Contextual Inquiries Remote Usability Testing Parallel Prototyping Persona Development\r\n\r\n• Un-moderated Feedback (example: UserZoom) Other User Centered Design (UCD) methods\r\n\r\n\r\nCandidates should be able to:\r\n\r\n• Quickly synthesize business objectives and customer needs\r\n\r\n• Develop a UX research approach, schedule, and detailed test plan\r\n\r\n• Plan, recruit, script, facilitate, collect, analyze, and document data\r\n\r\n• Identify and articulate user needs first and then potential usability issues both verbally and through documentation\r\n\r\n• Transform the data into prioritized, actionable recommendations (within a SHORT turn-around time)\r\n\r\n• Clearly communicate qualitative analysis, recommendations, and potential design solutions\r\n\r\n• Create persuasive presentations geared towards product owners, developers, visual designers, other UX team members, and c-level executives\r\n\r\n• Facilitate internal meetings to triage/manage research findings\r\n\r\n• Previous experience with design or research projects involving complex workflows, visualization of large datasets, operating system-level tools, and both web and software environments is a plus.\r\n\r\n\r\nQualifications:\r\n\r\n• Bachelor of Arts in a Social Science or Master of Science in a Social Sciences, Interaction Design, Human Factors, Cognitive Psychology, Cognitive Science, or related field is desired\r\n\r\n• 4+ years of experience applying research to high-volume, interactive B2B and B2C applications, rich web-based applications, or websites.\r\n\r\n• Strong, analytical problem solving, decision-making, and leadership\r\n\r\n• In-depth understanding of user-centered design principles and tools\r\n\r\n• Familiarity with SharePoint, project management tool like Jira\r\n\r\n• Familiarity performing studies in a fixed and virtual lab environment\r\n\r\n• Familiarity with data-logging tools and systems such as Tableau, Qualtrics, Morae or would be helpful..\r\n Skills: User Experience, Quantitative Research", "job_title": {"MainJobTitle": "UX Researcher", "JobTitle": ["Qualitative Specialist"]}}, {"filename": "b4c28a2c-5ac9-478e-85ef-d07b27991aae.json", "plain_text": " JobTitle: UI Designer - Sr Description:\r\nAbout the Role\r\n\r\n\r\nThe UI Designer will design and create user-centered online experiences in an agile environment. This role will suit a creative problem solver, looking to collaborate with technology, product and content teams to design elegant user interfaces and rich user experiences.\r\n\r\n\r\nResponsibilities\r\n\r\n\r\nTake complex information and creating interfaces that are simple to use and elegantly designed\r\n\r\n\r\nDesign and deliver high-quality, innovative user interface designs through all phases of the product design lifecycle\r\n\r\n\r\nWork alongside information architects, developers, researchers and subject matter experts to create new products, features and functionality\r\n\r\n\r\nGather, analyze and synthesize UI needs for complex product and user requirements\r\n\r\n\r\nCreate rapid iterations of visual and/or storyboard concepts, as well as the ability to design for large volumes of dynamic content\r\n\r\n\r\nPresent design options for review, from concept through final production\r\n\r\n\r\nHave an expert-level knowledge of UI design methodology and processes (user-centered and iterative design)\r\n\r\n\r\nHave a strong understanding and deep knowledge of current web and mobile design technology opportunities and limitations\r\n\r\n\r\nSolid understanding of principles of information organization and user interface design\r\n\r\n\r\nThorough understanding of established user interface standards as well as cutting-edge design conventions and interactions\r\n\r\n\r\nKnowledge of fundamental design principles and disciplines that affect typography, color use, animation, composition, use of space, distribution of information, etc.\r\n\r\n\r\nCreate high fidelity prototypes for UX research testing (Sketch, Invision, Adobe Xd)\r\n\r\n\r\nMust be an effective advocate for the user and be able to successfully lead the implementation of feature-sets and interactions that provide an excellent customer experience\r\n\r\n\r\nTurn user research and usability feedback into easy to use solutions\r\n\r\n\r\nJustify and articulate design decisions\r\n\r\n\r\nExtend visual design language, pattern libraries, usage guidelines\r\n\r\n\r\nDesign, document and maintain user interface patterns: Interaction controls and elements, building blocks, micro-Interactions, standards and guidelines\r\n\r\n\r\nQualifications\r\n\r\n\r\n4+ years design experience in an interaction design, information design, user interface design, human factors engineering, user experience, or information architect position\r\n\r\n\r\nProficiency in responsive design\r\n\r\n\r\nProficiency in prototyping tools: Sketch, InVision, Adobe Xd, and Abstract\r\n\r\n\r\nStrong portfolio of work\r\n\r\n\r\nBA/BS in graphic design, fine art, visual communications, HCI or related field (or equivalent industry training / experience)\r\n\r\n\r\nFamiliarity with Agile development\r\n\r\n\r\nConfidence in working with strong, passionate, fast-paced team environment\r\n\r\n\r\nStrong time-management, multi-tasking and prioritization skills\r\n\r\n\r\nCritical thinking and problem-solving skills\r\n\r\n\r\nExcellent written and verbal communication skills\r\n\r\n\r\nWorking knowledge / desire to learn: CSS, XHTML and JavaScript\r\n\r\n\r\nFamiliarity with: Web standards (W3C and 508) / best practices for interaction design and Accessibility\r\n Skills: Graphic Design, Abstract, user interface design, Sketch, Adobe Creative Cloud", "job_title": {"MainJobTitle": "UI Designer", "JobTitle": []}}, {"filename": "b88b9ed2-d007-4add-a009-476e1e147163.json", "plain_text": "    JobTitle: User Experience Designer\r\n    Description: <p>test</p>\r\n    Skills: visual design, UX Design, UI Design", "job_title": {"MainJobTitle": "User Experience Designer", "JobTitle": []}}, {"filename": "cb151044-fde1-4737-bdb1-fdd2191452a4.json", "plain_text": " JobTitle: UI Designer Description:\r\nAbout the Role\r\n\r\n\r\nThe UI Designer will design and create user-centered online experiences in an agile environment. This role will suit a creative problem solver, looking to collaborate with technology, product and content teams to design elegant user interfaces and rich user experiences.\r\n\r\n\r\nResponsibilities\r\n\r\n\r\nTake complex information and creating interfaces that are simple to use and elegantly designed\r\n\r\n\r\nDesign and deliver high-quality, innovative user interface designs through all phases of the product design lifecycle\r\n\r\n\r\nWork alongside information architects, developers, researchers and subject matter experts to create new products, features and functionality\r\n\r\n\r\nGather, analyze and synthesize UI needs for complex product and user requirements\r\n\r\n\r\nCreate rapid iterations of visual and/or storyboard concepts, as well as the ability to design for large volumes of dynamic content\r\n\r\n\r\nPresent design options for review, from concept through final production\r\n\r\n\r\nHave an expert-level knowledge of UI design methodology and processes (user-centered and iterative design)\r\n\r\n\r\nHave a strong understanding and deep knowledge of current web and mobile design technology opportunities and limitations\r\n\r\n\r\nSolid understanding of principles of information organization and user interface design\r\n\r\n\r\nThorough understanding of established user interface standards as well as cutting-edge design conventions and interactions\r\n\r\n\r\nKnowledge of fundamental design principles and disciplines that affect typography, color use, animation, composition, use of space, distribution of information, etc.\r\n\r\n\r\nCreate high fidelity prototypes for UX research testing (Sketch, Invision, Adobe Xd)\r\n\r\n\r\nMust be an effective advocate for the user and be able to successfully lead the implementation of feature-sets and interactions that provide an excellent customer experience\r\n\r\n\r\nTurn user research and usability feedback into easy to use solutions\r\n\r\n\r\nJustify and articulate design decisions\r\n\r\n\r\nExtend visual design language, pattern libraries, usage guidelines\r\n\r\n\r\nDesign, document and maintain user interface patterns: Interaction controls and elements, building blocks, micro-Interactions, standards and guidelines\r\n\r\n\r\nQualifications\r\n\r\n\r\n4+ years design experience in an interaction design, information design, user interface design, human factors engineering, user experience, or information architect position\r\n\r\n\r\nProficiency in responsive design\r\n\r\n\r\nProficiency in prototyping tools: Sketch, InVision, Adobe Xd, and Abstract\r\n\r\n\r\nStrong portfolio of work\r\n\r\n\r\nBA/BS in graphic design, fine art, visual communications, HCI or related field (or equivalent industry training / experience)\r\n\r\n\r\nFamiliarity with Agile development\r\n\r\n\r\nConfidence in working with strong, passionate, fast-paced team environment\r\n\r\n\r\nStrong time-management, multi-tasking and prioritization skills\r\n\r\n\r\nCritical thinking and problem-solving skills\r\n\r\n\r\nExcellent written and verbal communication skills\r\n\r\n\r\nWorking knowledge / desire to learn: CSS, XHTML and JavaScript\r\n\r\n\r\nFamiliarity with: Web standards (W3C and 508) / best practices for interaction design and Accessibility..\r\n Skills: Graphic Design, Abstract", "job_title": {"MainJobTitle": "UI Designer", "JobTitle": []}}, {"filename": "e3adc0be-d156-47f7-86d9-4dac8b20c5e3.json", "plain_text": " JobTitle: User Experience Designer (UX) Description:\r\nDescription:\r\n\r\nHere is the job description:\r\n\r\n\r\nAs an Experience Designer you would join the Central Experience Design Group (Central XD) of the Tax & Accounting Business of Thomson Reuters, which is engaged in reshaping entire market-leading product lines. Our fun and diverse group, which reports into the office of the CTO, works across disciplines, practices Design Thinking and applies lean methodologies. We have a large product portfolio in the Enterprise space that we are unifying with a new, top-to-bottom design. Our clients are professionals from around the world who are accustomed to using sophisticated applications with rich interaction models.\r\n\r\n\r\nResponsibilities\r\n\r\n• Work closely with product teams to uncover business needs, develop design strategies and communicate your design solutions\r\n\r\n• Design and specify the product experience using iterative design techniques including persona creation, journey mapping, design studios, customer interviews and usability testing\r\n\r\n• Produce design artifacts such as personas, journey maps, sketches, scenarios, wireframes, mental models and prototypes\r\n\r\n• Effectively communicate research findings, conceptual ideas and detailed design rationale both verbally and visually\r\n\r\n• Help define and maintain a global patterns and guidelines library\r\n\r\n• Evangelize experience design throughout the organization\r\n\r\n\r\nQualifications\r\n\r\n• Proven ability to work in a cross-discipline, open and creative team\r\n\r\n• Highly creative, detail-oriented, passionate about delivering the best user experience possible\r\n\r\n• Excellent communication and writing skills\r\n\r\n• Ability to work independently and juggle multiple UX projects at a time\r\n\r\n• Proficiency in Axure, Invision and Sketch\r\n\r\n• Familiarity with modern web technologies\r\n\r\n• A portfolio demonstrating relevant experience in user-centric design.\r\n Skills: Wireframes, UX Design, User Centric Design, Prototypes, User Experience", "job_title": {"MainJobTitle": "User Experience Designer (UX)", "JobTitle": ["User Experience Designer", "Designer"]}}, {"filename": "f0d0323c-8eff-4310-b9a6-712e2b6181b8.json", "plain_text": "    JobTitle: Software Architect\r\n    Description: <p>Software Architect.</p>\r\n    Skills: .net", "job_title": {"MainJobTitle": "Software Architect", "JobTitle": []}}, {"filename": "f10bd641-3aa7-472b-9862-7674740acb62.json", "plain_text": " JobTitle: UX Researcher - Sr Description:\r\nDescription:\r\n\r\nWe're looking for a User Experience Researcher to help us partner with our customers in developing desktop and mobile applications for professionals in the legal industry.\r\n\r\nThe person in this dedicated role will work closely with local and remote teammates in user experience, product development, and technology teams. Research projects will take place with external legal firms working in Partnership Programs with Thomson Reuters and other external customers.\r\n\r\nThe candidate should have demonstrated success in research facilitation as well as comfort in the role of research observer and note taker.\r\n\r\nThis is not a designer role; it is a role focusing on leading and executing design and usability research. However, experience with interaction design principles, tools, and techniques is important both for communication with the internal team and articulating issues to stakeholders. The successful candidate will be comfortable in a fast-paced environment where research studies will be executed on a weekly basis.\r\n\r\nCandidates should have a broad knowledge and experience with a wide variety of research methods, both qualitative and quantitative, including:\r\n\r\n• Think Aloud usability studies\r\n\r\n• Heuristic Evaluations\r\n\r\n• Contextual Inquiries\r\n\r\n• Remote Usability Testing\r\n\r\n• Parallel Prototyping\r\n\r\n• Persona Development\r\n\r\n• Card Sorting\r\n\r\n• A/B Testing\r\n\r\n• Un-moderated Feedback (example: Usabilla)\r\n\r\n• Other User Centered Design (UCD) methods\r\n\r\nCandidates should be able to:\r\n\r\n• Quickly synthesize business objectives and customer needs\r\n\r\n• Develop a UX research approach, schedule, and detailed test plan\r\n\r\n• Plan, recruit, script, facilitate, collect, analyze, and document usability data\r\n\r\n• Identify and articulate potential usability issues both verbally and through documentation\r\n\r\n• Transform the data into prioritized, actionable recommendations (within a SHORT turn-around time)\r\n\r\n• Clearly communicate usability analysis, recommendations, and potential design solutions\r\n\r\n• Create persuasive presentations geared towards product owners, developers, visual designers, other UX team members, and c-level executives\r\n\r\n• Facilitate internal meetings to triage/manage research findings\r\n\r\nPrevious experience with design or research projects involving complex workflows, visualization of large datasets, operating system-level tools, and both web and software environments is a plus.\r\n\r\nQualifications\r\n\r\n• Bachelor of Science or Master of Science in Human-Computer Interaction, Interaction Design, Human Factors, Cognitive Psychology, Cognitive Science, or related field\r\n\r\n• 4+ years of experience applying research to high-volume, interactive B2B and B2C desktop applications, rich Web-based applications, or platform-level tools\r\n\r\n• Strong, analytical problem solving, decision-making, and leadership skills\r\n\r\n• In-depth understanding of user-centered design principles and tools\r\n\r\n• Familiarity with SharePoint\r\n\r\n• Familiarity performing studies in a fixed usability lab environment\r\n\r\n• Familiarity with data-logging tools and systems such as Morae or Camtasia..\r\n\r\n\r\n Skills: UI / UX Development, User Centric Design, User Experience, Quantitative Research, User Research", "job_title": {"MainJobTitle": "UX Researcher", "JobTitle": []}}, {"filename": "f4728782-2833-40d3-9599-a7e3b5ab6260.json", "plain_text": "    JobTitle: Cloud Engineer\r\n    Description: <p>test</p>\r\n    Skills: Cloud, Network Engineering", "job_title": {"MainJobTitle": "Cloud Engineer", "JobTitle": []}}]